In [3]:
import pandas as pd
from sqlalchemy import create_engine, text

# Quick check
def query_execute(query, return_result=True):
    engine = create_engine("mysql+pymysql://root:1234@localhost/loan")
    with engine.connect() as connection:
        if return_result:
             
            return pd.read_sql(query, connection)
        else:
            connection.execute(text(query))
            connection.commit()

In [3]:
loan_details = query_execute("""
describe loan_details
""")
loan_details

                    Field        Type Null Key Default Extra
0                loan_key      bigint  YES        None
1              is_current  tinyint(1)  YES        None
2              branch_key      bigint  YES        None
3             product_key        text  YES        None
4      disbursment_dateid      bigint  YES        None
5    principal_amount_eur      double  YES        None
6  loan_officer_user_code        text  YES        None

In [15]:
loan_details = query_execute("""
select   loan_key  from loan_details where loan_key is null or loan_key = ''  or loan_key <= 0
""")
loan_details

Empty DataFrame
Columns: [loan_key]
Index: []

In [7]:
loan_details = query_execute("""
select disbursment_dateid from loan_details where disbursment_dateid is null or disbursment_dateid = '' or disbursment_dateid <=0
""")
loan_details

Empty DataFrame
Columns: [disbursment_dateid]
Index: []

In [8]:
loan_details = query_execute("""
select  distinct branch_key from loan_details 
""")
loan_details

   branch_key
0          66
1          63
2          64
3          67
4          68

In [46]:
loan_details = query_execute("""
select   count(loan_officer_user_code)  from loan_details where  loan_officer_user_code = '' 
""")
loan_details

   count(loan_officer_user_code)
0                              0

In [26]:
loan_details = query_execute("""
select   principal_amount_eur  from loan_details where principal_amount_eur is null or principal_amount_eur = '' or principal_amount_eur <= 0
""")
loan_details

Empty DataFrame
Columns: [principal_amount_eur]
Index: []

In [16]:
loan_details = query_execute("""
describe loan_details
""")
loan_details

                    Field        Type Null Key Default Extra
0                loan_key      bigint  YES        None
1              is_current  tinyint(1)  YES        None
2              branch_key      bigint  YES        None
3             product_key        text  YES        None
4      disbursment_dateid      bigint  YES        None
5    principal_amount_eur      double  YES        None
6  loan_officer_user_code        text  YES        None

In [19]:
# · 1. Monthly disbursements in EUR for the last 6 months. Please consider principal_amount_eur as a
# measure
loan_details = query_execute("""

ALTER TABLE loan_details
ADD COLUMN disbursement_date DATE;

""",return_result=False)
loan_details

In [20]:
# · 1. Monthly disbursements in EUR for the last 6 months. Please consider principal_amount_eur as a
# measure
loan_details = query_execute("""

UPDATE loan_details
SET disbursement_date = STR_TO_DATE(disbursment_dateid, '%Y%m%d');


""",return_result=False)
loan_details

In [43]:
loan_details = query_execute("""
select loan_key, principal_amount_eur,disbursement_date	 from loan_details order  by disbursement_date desc limit 5

""")
loan_details

   loan_key  principal_amount_eur disbursement_date
0  15485934                343.79        2020-07-23
1  15479566               1136.53        2020-07-23
2  15479554               4728.68        2020-07-23
3  15474210                449.22        2020-07-23
4  15474186               1963.71        2020-07-23

In [39]:
loan_details = query_execute("""
SELECT
    DATE_FORMAT(disbursement_date, '%%Y-%%m') AS disbursement_month,
    SUM(principal_amount_eur) AS total_disbursed_eur
FROM loan_details
WHERE disbursement_date >= DATE_SUB('2020-07-23', INTERVAL 6 MONTH)
  AND disbursement_date <= '2020-07-23
'
GROUP BY disbursement_month
ORDER BY disbursement_month DESC

""")
loan_details

  disbursement_month  total_disbursed_eur
0            2020-07            695384.70
1            2020-06            728847.40
2            2020-05             24891.52
3            2020-04              4333.69
4            2020-03            249138.59
5            2020-02            768397.11
6            2020-01            635064.41

In [41]:
loan_details = query_execute("""
select sum(principal_amount_eur) as total_disbursed_eur from loan_details
where disbursement_date >= DATE_SUB('2020-07-23', INTERVAL 6 MONTH)
  AND disbursement_date <= '2020-07-23'
""")
loan_details

   total_disbursed_eur
0           3106057.42

In [49]:
loan_details = query_execute("""
SELECT 
    SUM(loan_details.principal_amount_eur) AS total_disbursed_eur
FROM 
    loan_details
JOIN 
    loan_snapshots ON loan_details.loan_key = loan_snapshots.loan_key
WHERE 
    loan_details.disbursement_date >= DATE_SUB('2020-07-23', INTERVAL 6 MONTH)
    AND loan_details.disbursement_date <= '2020-07-23'
""")
loan_details

   total_disbursed_eur
0             43972.34

In [ ]:

# · 2. Disbursements per loan_officer. Please use visualization to show the count of loans disbursed per each
# loan officer for the last month. In addition, we would like to see the volume of disbursed loan as well
# (sum(principal_amount_eur)).

In [5]:
loan_details = query_execute("""
select loan_key,branch_key,principal_amount_eur,loan_officer_user_code,disbursement_date from loan_details limit 5

""")
loan_details

,loan_key,branch_key,principal_amount_eur,loan_officer_user_code,disbursement_date
0,1000594,66,1117.98,CHUM,2014-04-25
1,1000598,66,1117.98,EMMC,2014-04-25
2,1000602,66,532.66,CAUM,2014-04-30
3,1000606,66,533.00,FIRU,2014-04-24
4,1000610,66,638.85,EMMU,2014-04-25

In [14]:
loan_details = query_execute("""
SELECT 
    loan_officer_user_code,
    COUNT(loan_officer_user_code) AS loan_count,
    SUM(principal_amount_eur) AS total_disbursed_eur
FROM 
    loan_details 
WHERE 
    disbursement_date >= '2020-06-01' 
    AND disbursement_date < '2020-07-01'
GROUP BY 
    loan_officer_user_code
ORDER BY 
    total_disbursed_eur DESC
""")
loan_details

   loan_officer_user_code  loan_count  total_disbursed_eur
0                    NAUM           4             53460.82
1                    LYIN           2             46863.49
2                    NAMU           2             34504.33
3                    YVNT          19             25878.55
4                    EMBI           2             25713.21
5                    NIAB          11             24404.16
6                    JUUW           5             23934.50
7                    DAMU           8             21918.35
8                    DEWU          11             21529.18
9                    CLMU           8             21430.09
10                   MUSY           9             20848.27
11                   PEKA           7             20063.31
12                   JOUM          14             19465.69
13                   EMBE          14             18850.80
14                   EMTU          10             16991.36
15                   SETW           7             15812.57
16                   PAMA           2             15426.95
17                   ILNS          12             14359.76
18                   KADE          10             14341.30
19                   MAJA           9             14104.85
20                   MUJE           9             14018.98
21                   MUDE           6             13907.14
22                   FRNS           5             13492.62
23                   FIUW          10             13391.05
24                   ERUW           5             12234.51
25                   FRNZ          15             12232.51
26                   EMNK          11             11921.91
27                   JPMA           3              9986.17
28                   PAMB           6              9865.05
29                   MBER           5              9748.83
30                   EMRU           2              9386.70
31                   DIUW           4              9251.57
32                   AMUW           7              8595.10
33                   CLIM           6              8375.78
34                   BING           7              7852.06
35                   ADND           8              7712.79
36                   ANUD           6              7437.53
37                   SHEG           4              6412.14
38                   ANNS           7              6370.21
39                   FEMU           6              6056.16
40                   STAF          22              5394.69
41                   MULA           4              5341.58
42                   MABA           5              5219.03
43                   ANCY           6              5113.75
44                   DEUM           3              4974.38
45                   DINY           1              4574.89
46                   PATU           4              4556.66
47                   VIBY           8              4533.99
48                   VASI           6              4327.49
49                   JDAY           5              4275.73
50                   JBNZ           4              3697.51
51                   JAUW           6              2928.66
52                   ASIN           2              2184.48
53                   ERND           1              1527.53
54                   CAUM           1              1232.92
55                   JDUW           1               813.76

In [ ]:
# · 3. Portfolio at risk. Please use visualization (KPI) to show the (sum of principal_axmount_outstanding_eur)
# with overdue days is greater than 30 divided by total sum(principal_amount_outstanding_eur)

In [5]:
loan_details = query_execute("""
describe loan_details
""")
loan_details

                    Field        Type Null Key Default Extra
0                loan_key      bigint  YES        None
1              is_current  tinyint(1)  YES        None
2              branch_key      bigint  YES        None
3             product_key        text  YES        None
4      disbursment_dateid      bigint  YES        None
5    principal_amount_eur      double  YES        None
6  loan_officer_user_code        text  YES        None
7       disbursement_date        date  YES        None

In [6]:
loan_details = query_execute("""
describe loan_snapshots
""")
loan_details

                              Field        Type Null Key Default Extra
0                     loan_snap_key      bigint  YES        None
1                        is_current  tinyint(1)  YES        None
2                          loan_key      bigint  YES        None
3                   business_dateid      bigint  YES        None
4  principal_amount_outstanding_eur      double  YES        None
5                      overdue_days      bigint  YES        None